"""
Туристические агентства предлагают следующие туры. Вояж – Мексика, Канада, Израиль,
Италия. РейнаТур – Англия, Япония, Канада, ЮАР. Определить:
1. Какие туры из Вояж, отсутствуют в РейнаТур.
2. Какие товары из РейнаТур, отсутствуют в Вояж
3. Перечень одинаковых туров.
4. Равны ли перечни туров
"""

voyage = {'Мексика', 'Канада', 'Израиль', 'Италия'}
reina_tour = {'Англия', 'Япония', 'Канада', 'ЮАР'}

print('1. какие туры из Вояж, отсутствуют в РейнаТур.')
print(voyage.difference(reina_tour))
# or voyage - reina_tour
print('2. какие товары из РейнаТур, отсутствуют в Вояж')
print(reina_tour.difference(voyage))
# or reina_tour - voyage
print('3. перечень одинаковых туров.')
print(voyage.intersection(reina_tour))
# or  voyage & reina_tour
print('4. равны ли перечни туров')
print(voyage == reina_tour)
