import re

"""
Дана строка, содержащая латинские буквы и круглые скобки. Если скобки
расставлены правильно (то-есть каждой открывающей соответствует одна
закрывающая), то вывести число 0. В противном случае вывести или номер позиции,
в которой расположена первая ошибочная закрывающая скобка, или, если
закрывающих скобок не хватает, число —1.
"""


def spell_check(st):
    num = 0
    i = 0
    for c in st:
        if c == '(':
            num += 1
        elif c == ')':
            if num == 0:
                return i+1
            num -= 1
        i += 1
    if num > 0:
        return -1
    return num


while True:
    s = str(input('Введите строку, содержащую латинские буквы и круглые скобки: \n'))
    if re.search(r'[^a-zA-Z()]', s):
        print('Вводите только латинские буквы и круглые скобки')
    else:
        print(spell_check(s))