"""
Дано целое число A. Проверить истинность высказывания: «Число A является
нечетным».
"""

while True:
    try:
        a = int(input('Введите число А: '))
        if a > 0:
            print('Число A является нечетным') if a % 2 == 1 else print('Число A является четным')
        else:
            print('Число не может быть отрицательным или равняться нулю')
    except TypeError:
        print('Вводите числа')
    except ValueError:
        print('Введите целое число')