"""
Дано целое число A. Проверить истинность высказывания: «Число A является
нечетным».
"""

a = int(input('Ведите число А: '))
print('Число A является нечетным') if a % 2 == 1 else print('Число A является четным')